#+STARTUP: overview
#+STARTUP: logdrawer
#+STARTUP: hideblocks

#+PROPERTY: header-args: :eval never-export

#+PROPERTY: header-args:jupyter :session ~/jupyter-run/active-local-py.json
#+PROPERTY: header-args:jupyter: :exports both
#+PROPERTY: header-args:jupyter: :cache yes
#+PROPERTY: header-args:jupyter: :eval never-export

#+PROPERTY: header-args:jupyter-python :session ~/jupyter-run/active-local-py.json
#+PROPERTY: header-args:jupyter-python: :exports both
#+PROPERTY: header-args:jupyter-python: :cache yes
#+PROPERTY: header-args:jupyter-python: :eval never-export

#+PROPERTY: header-args:jupyter-julia :session ~/jupyter-run/active-local-jl.json
#+PROPERTY: header-args:jupyter-julia: :exports both
#+PROPERTY: header-args:jupyter-julia: :cache yes
#+PROPERTY: header-args:jupyter-julia: :eval never-export

#+PROPERTY: header-args:bash: :exports code

#+PROPERTY: header-args:elisp: :exports both

#+PROPERTY: header-args:bibtex :exports none
#+BIBLIOGRAPHY: "./refs.bib"
#+BIBLIOGRAPHY: "../learn/refs.bib"
#+PROPERTY: header-args:bibtex :tangle "./refs.bib"
#+CITE_EXPORT: natbib


#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [a4paper,12pt]
#+LATEX_HEADER: \usepackage[utf8]{inputenc}
#+LATEX_HEADER: \usepackage{booktabs} % for much better looking tables
#+LATEX_HEADER: \usepackage{g\usepackage{babel}
#+LATEX_HEADER: \usepackage{babel}
#+LATEX_HEADER: \usepackage[up,bf,raggedright]{titlesec}
#+LATEX_HEADER: \usepackage{paralist} % flexible & customisable lists (enumerate/itemize, etc.)
#+LATEX_HEADER: \usepackage{subfig} % make it possible to include more than one captioned figure/table in a single float
#+LATEX_HEADER: \usepackage[labelfont=bf,font=small]{caption}
#+LATEX_HEADER: \usepackage[hidelinks]{hyperref}% for adding urls
#+LATEX_HEADER: \usepackage{sectsty}
#+LATEX_HEADER: \allsectionsfont{\sffamily\mdseries\upshape} % (See the fntguide.pdf for font help)
#+LATEX_HEADER: \sectionfont{\bfseries\Large\raggedright}
* Locating space

We can use ~longitude~ and ~latitude~ to locate points on the Earth's surface. To specify a region we can use bounding boxes specified by the positions of it's four corners.

#+name: define-point-bbox
#+begin_src jupyter-python
from dataclasses import dataclass
from lazy import lazy
from typing import Tuple, List
import numpy as np
import folium

@dataclass
class GeoPoint:
    """A point on Earth's surface specified by longitude and latitude."""
    longitude: float  # in degrees, -180 to +180
    latitude: float   # in degrees, -90 to +90

    def __post_init__(self):
        """Validate coordinates are within valid ranges."""
        if not -180 <= self.longitude <= 180:
            raise ValueError(f"Longitude {self.longitude} outside valid range [-180, 180]")
        if not -90 <= self.latitude <= 90:
            raise ValueError(f"Latitude {self.latitude} outside valid range [-90, 90]")

    @lazy
    def coords(self) -> Tuple[float, float]:
        """Return coordinates as (longitude, latitude) tuple."""
        return (self.longitude, self.latitude)

@dataclass
class BoundingBox:
    """A rectangular region on Earth's surface defined by its corners."""
    west: float   # minimum longitude
    south: float  # minimum latitude
    east: float   # maximum longitude
    north: float  # maximum latitude

    def __post_init__(self):
        """Validate coordinates and ensure west ≤ east and south ≤ north."""
        for lon in [self.west, self.east]:
            if not -180 <= lon <= 180:
                raise ValueError(f"Longitude {lon} outside valid range [-180, 180]")
        for lat in [self.south, self.north]:
            if not -90 <= lat <= 90:
                raise ValueError(f"Latitude {lat} outside valid range [-90, 90]")
        if self.west > self.east:
            raise ValueError("Western boundary must be ≤ eastern boundary")
        if self.south > self.north:
            raise ValueError("Southern boundary must be ≤ northern boundary")

    @lazy
    def corners(self) -> List[GeoPoint]:
        """Return the four corners of the bounding box as GeoPoints."""
        return [GeoPoint(self.west, self.south),
                GeoPoint(self.east, self.south),
                GeoPoint(self.east, self.north),
                GeoPoint(self.west, self.north)]

    @lazy
    def southwest(self):
        return GeoPoint(self.west, self.south)

    @lazy
    def southeast(self):
        return GeoPoint(self.east, self.south)

    @lazy
    def northwest(self):
        return GeoPoint(self.west, self.north)

    @lazy
    def northeast(self):
        return GeoPoint(self.east, self.north)

    @lazy
    def center(self) -> GeoPoint:
        """Return the center point of the bounding box."""
        return GeoPoint(longitude=(self.west + self.east) / 2,
                        latitude=(self.south + self.north) / 2)

    def contains(self, point: GeoPoint) -> bool:
        """Check if a point lies within the bounding box."""
        return (self.west <= point.longitude <= self.east
                 and self.south <= point.latitude <= self.north)

    @lazy
    def shapely(self):
        """Convert to shapely box for geometric operations."""
        return box(self.sw_corner.longitude, self.sw_corner.latitude,
                   self.ne_corner.longitude, self.ne_corner.latitude)
#+end_src

We can visualize a ~BoundingBox~ as a map using ~folium~,
#+name: preview-map
#+begin_src jupyter-python :noweb yes
@bindclass(BoundingBox)
def preview_map(bbox, zoom: int = 10, saveas=None) -> folium.Map:
    mbox = folium.Map(location=[center.latitude, center.longitude],
                      zoom_start=zoom,
                      tiles="CartoDB positron", prefer_canvas=True)

    coordinates = [[bbox.southwest.latitude, bbox.southwest.longitude],
                   [bbox.northeast.latitude, bbox.southwest.longitude],
                   [bbox.northeast.latitude, bbox.northeast.longitude],
                   [bbox.southwest.latitude, bbox.northeast.longitude]]

    folygon = folium.Polygon(coordinates, color="red", fill=False,
                             weight=2, opacity=0.1)
    folygon.add_to(mbox)

    if saveas:
        mbox.save(saveas)
    return mbox

#+end_src

#+RESULTS: preview-map

We have defined,
1. A =GeoCoordinate= class to represent points on Earth's surface
2. A =BoundingBox= class to define rectangular regions
3. Validation to ensure coordinates are within valid ranges
4. Utility methods for checking if points are within regions
5. A method to find the center of a region

Let us test this code by producing a basemap for the Parvati valley,
#+begin_src jupyter-python
parvati_bbox = BoundingBox(west=77.18, south=31.81, east=77.81, north=32.14)

# Get the center point of our region
center = parvati_bbox.center
print("Center of our region:"
      f" {center.longitude:.2f}°E, {center.latitude:.2f}°N")

map_parvati = parvati_bbox.preview_map(saveas=workdir/"parvati_0.html")
#+end_src

#+RESULTS:
: Center of our region: 77.50°E, 31.98°N


We could extend this base implementation to add features like:
- Distance calculations between points (using great circle distance)
- Conversion between different coordinate systems
- Integration with mapping libraries like =folium= or =geopandas=
- Methods to generate grids within the bounding box
- Functions to load and save regions in standard GIS formats

